import React from 'react';
import styles from "./chat.module.css";
import {Link, Outlet} from "react-router-dom";
import { Tab, Tabs, TabList, TabPanel } from 'react-tabs';

const FunctioningChat = ({voice, sound}) => {
  const [messages, setMessages] = React.useState([
    {
      id: 1,
      type: "system",
      text: "Здравствуйте! Давайте разберёмся, что произошло. \n" +
        "Расскажите нам о своей проблеме — голосовым сообщением или текстом.",
      timestamp: new Date().toLocaleTimeString([], { hour: "2-digit", minute: "2-digit" }),
    }
  ]);
  const [inputValue, setInputValue] = React.useState("");
  const messagesEndRef = React.useRef(null);

  const changeVoiceMode = (tf) => {
    voice(tf)
  }

  // Скролл вниз
  const scrollToBottom = () => {
    if (messagesEndRef.current) {
      messagesEndRef.current.scrollIntoView({ behavior: "smooth" });
    }
  };

  React.useEffect(() => {
    scrollToBottom();
  }, [messages]);

  React.useEffect(() => {
    if (sound) {
      setMessages((prevMessages) => [sound, ...prevMessages]);
    }
  }, [sound])

  // Отправка сообщения и запрос к серверу
  const handleSendMessage = async () => {
    if (inputValue.trim() === "") return;

    const userMessage = {
      id: messages.length + 1,
      type: "user",
      text: inputValue,
      timestamp: new Date().toLocaleTimeString([], { hour: "2-digit", minute: "2-digit" }),
    };

    // Обновляем сообщения (добавляем сообщение пользователя)
    setMessages((prevMessages) => [userMessage, ...prevMessages]);
    setInputValue("");

    try {
      // Отправка запроса на сервер
      const response = await fetch("https://63dd-5-164-217-6.ngrok-free.app//api/send_message", {
        method: "POST",
        headers: {
          "Content-Type": "application/json",
        },
        body: JSON.stringify({ message: inputValue, address: 'ул. Крупская, д. 7' }),
      });

      const data = await response.json();

      // Ответ от сервера
      const serverMessage = {
        id: messages.length + 2,
        type: "system",
        text: data['data']['message'],
        category: data['data']['problem_category'] ?? '',
        timestamp: new Date().toLocaleTimeString([], { hour: "2-digit", minute: "2-digit" }),
      };

      // Обновляем сообщения (добавляем ответ сервера)
      setMessages((prevMessages) => [serverMessage, ...prevMessages]);
    } catch (error) {
      console.error("Ошибка при запросе:", error);

      // Показываем сообщение об ошибке
      const errorMessage = {
        id: messages.length + 2,
        type: "system",
        text: "Не удалось связаться с сервером. Попробуйте позже.",
        timestamp: new Date().toLocaleTimeString([], { hour: "2-digit", minute: "2-digit" }),
      };

      setMessages((prevMessages) => [errorMessage, ...prevMessages]);
    }
  };

  let isRecording = false;
  let mediaRecorder;
  let audioChunks = [];
  let recordingTimeout; // Таймер для остановки записи
  let audioStream; // Переменная для хранения потока

  const sendAudioMessage = async () => {
    if (!isRecording) {
      // Запрашиваем доступ к микрофону
      audioStream = await navigator.mediaDevices.getUserMedia({ audio: true });
      mediaRecorder = new MediaRecorder(audioStream);

      mediaRecorder.onstart = () => {
        audioChunks = [];
        console.log("Запись началась");

        // Устанавливаем таймер для автоматической остановки записи
        recordingTimeout = setTimeout(() => {
          if (isRecording) {
            stopRecording();
          }
        }, 5000); // 5000 мс = 5 секунд
      };

      mediaRecorder.ondataavailable = (event) => {
        audioChunks.push(event.data);
      };

      mediaRecorder.onstop = async () => {
        console.log("Запись завершена");

        const audioBlob = new Blob(audioChunks, { type: "audio/wav" });

        // Освобождаем ресурсы потока
        audioStream.getTracks().forEach((track) => track.stop());

        // Отправляем аудио на сервер
        const formData = new FormData();
        formData.append("audio", audioBlob);

        try {
          const response = await fetch("https://63dd-5-164-217-6.ngrok-free.app//api/send_audio", {
            method: "POST",
            body: formData,
          });
          const data = await response.json();

          console.log(data)

          const userMessage = {
            id: messages.length + 1,
            type: "user",
            text: data[0]['data']['user_message'],
            timestamp: new Date().toLocaleTimeString([], { hour: "2-digit", minute: "2-digit" }),
          };

          // Обновляем сообщения (добавляем сообщение пользователя)
          setMessages((prevMessages) => [userMessage, ...prevMessages]);
          setInputValue("");

          const serverMessage = {
            id: messages.length + 2,
            type: "system",
            text: data[0]['data']['resp']['message'],
            category: data[0]['data']['resp']['problem_category'] ?? '',
            timestamp: new Date().toLocaleTimeString([], { hour: "2-digit", minute: "2-digit" }),
          };

          setMessages((prevMessages) => [serverMessage, ...prevMessages]);

          return data;
        } catch (error) {
          console.error("Ошибка:", error);
        }
      };

      mediaRecorder.start();
      isRecording = true;
    } else {
      stopRecording();
    }
  };

// Вспомогательная функция для остановки записи
  const stopRecording = () => {
    clearTimeout(recordingTimeout); // Сбрасываем таймер
    mediaRecorder.stop();
    isRecording = false;
  };

  return (
    <div className={styles["chat-panel"]}>
      <div className={styles['messageHistory']}>
        {messages.map((message) => {
          return (
            <div
              key={message.id}
              className={
                message.type === "user"
                  ? styles["userMessage"]
                : styles["systemMessage"]
            }
          >
            {message.category ? (
              <div>
                <span className={styles['request__header']}>Заявка сформирована</span>
                <div className={styles["request__header-div"]}>
                  <span className={styles['request__header-text']}>
                    Заголовок:
                  </span>
                  <span>{message.text}</span>
                </div>
                <div className={styles["request__header-div"]}>
                  <span className={styles['request__header-text']}>Адрес:</span>
                  <span>Ул. Новорождественская, д. 55</span>
                </div>
                <div className={styles["request__header-div"]}>
                  <span className={styles['request__header-text']}>Материалы:</span>
                  <span>не добавлено</span>
                </div>
                <div className={styles["request__header-div"]}>
                  <button className={styles['request__send']}>Отправить</button>
                  <button className={styles['request__know']}>Уточнить детали</button>
                </div>
              </div>
            ) : (
              <div>{message.text}</div>
            )}

            <span className={styles["timestamp"]}>{message.timestamp}</span>
          </div>
        )})}
        <div ref={messagesEndRef}/>
      </div>
      <div className={styles['inputContainer']}>
        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path
            d="M12 0C18.6274 0 24 5.37258 24 12C24 18.6274 18.6274 24 12 24C5.37258 24 0 18.6274 0 12C0 5.37258 5.37258 0 12 0ZM12 2C6.47715 2 2 6.47715 2 12C2 17.5228 6.47715 22 12 22C17.5228 22 22 17.5228 22 12C22 6.47715 17.5228 2 12 2ZM12 6C12.5523 6 13 6.44772 13 7V11H17C17.5523 11 18 11.4477 18 12C18 12.5523 17.5523 13 17 13H13V17C13 17.5523 12.5523 18 12 18C11.4477 18 11 17.5523 11 17V13H7C6.44772 13 6 12.5523 6 12C6 11.4477 6.44772 11 7 11H11V7C11 6.44772 11.4477 6 12 6Z"
            fill="#2688EB"/>
        </svg>
        <form onSubmit={(event) => {
          event.preventDefault();
          handleSendMessage()
        }}>
          <input
            type="text"
            value={inputValue}
            onChange={(e) => setInputValue(e.target.value)}
            placeholder="Cообщение"
          />
          <input type="submit" hidden style={{display: 'none'}}/>
        </form>
        <button onClick={() => {sendAudioMessage()}}>
          <svg width="18" height="25" viewBox="0 0 18 25" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd"
                  d="M2.99128 6C2.99128 2.68629 5.67954 0 8.99566 0C12.3118 0 15 2.68629 15 6V11C15 14.3137 12.3118 17 8.99566 17C5.67954 17 2.99128 14.3137 2.99128 11V6ZM8.99566 2C6.78491 2 4.99274 3.79086 4.99274 6V11C4.99274 13.2091 6.78491 15 8.99566 15C11.2064 15 12.9986 13.2091 12.9986 11V6C12.9986 3.79086 11.2064 2 8.99566 2Z"
                  fill="#2688EB"/>
            <path
              d="M17.8883 15.5865C18.1418 15.0957 17.9492 14.4925 17.458 14.2392C16.9669 13.9859 16.3633 14.1784 16.1098 14.6692C15.4365 15.9727 14.4176 17.0661 13.1644 17.8299C11.9112 18.5937 10.472 18.9985 9.00405 19C7.53613 19.0015 6.09605 18.5997 4.84125 17.8386C3.58645 17.0774 2.56523 15.9861 1.88924 14.6841C1.63472 14.1938 1.03069 14.0026 0.540091 14.2569C0.0494953 14.5113 -0.141884 15.1149 0.112635 15.6051C0.95762 17.2327 2.23415 18.5967 3.80265 19.5482C5.08165 20.3241 6.51465 20.8012 7.99493 20.9499V24C7.99493 24.5523 8.44298 25 8.99566 25C9.54835 25 9.99639 24.5523 9.99639 24V20.9499C11.4838 20.8005 12.9232 20.3195 14.2066 19.5373C15.7731 18.5826 17.0468 17.2158 17.8883 15.5865Z"
              fill="#2688EB"/>
          </svg>
        </button>
      </div>
    </div>
  );
};


const Chat = () => {
  const [voiceMode, setVoiceMode] = React.useState(true);
//   const [soundAnswer, setSoundAnswer] = React.useState({});
//
//   let isRecording = false;
//   let mediaRecorder;
//   let audioChunks = [];
//   let recordingTimeout; // Таймер для остановки записи
//   let audioStream; // Переменная для хранения потока
//
//   const sendAudioMessage = async () => {
//     if (!isRecording) {
//       // Запрашиваем доступ к микрофону
//       audioStream = await navigator.mediaDevices.getUserMedia({ audio: true });
//       mediaRecorder = new MediaRecorder(audioStream);
//
//       mediaRecorder.onstart = () => {
//         audioChunks = [];
//         console.log("Запись началась");
//
//         // Устанавливаем таймер для автоматической остановки записи
//         recordingTimeout = setTimeout(() => {
//           if (isRecording) {
//             stopRecording();
//           }
//         }, 5000); // 5000 мс = 5 секунд
//       };
//
//       mediaRecorder.ondataavailable = (event) => {
//         audioChunks.push(event.data);
//       };
//
//       mediaRecorder.onstop = async () => {
//         console.log("Запись завершена");
//
//         const audioBlob = new Blob(audioChunks, { type: "audio/wav" });
//
//         // Освобождаем ресурсы потока
//         audioStream.getTracks().forEach((track) => track.stop());
//
//         // Отправляем аудио на сервер
//         const formData = new FormData();
//         formData.append("audio", audioBlob);
//
//         try {
//           const response = await fetch("https://63dd-5-164-217-6.ngrok-free.app//api/send_audio", {
//             method: "POST",
//             body: formData,
//           });
//           const data = await response.json();
//
//           const serverMessage = {
//             id: messages.length + 2,
//             type: "system",
//             text: data['data']['user_message'],
//             category: data['data']['resp'] ?? '',
//             timestamp: new Date().toLocaleTimeString([], { hour: "2-digit", minute: "2-digit" }),
//           };
//
//           setSoundAnswer(serverMessage);
//           return data;
//         } catch (error) {
//           console.error("Ошибка:", error);
//         }
//       };
//
//       mediaRecorder.start();
//       isRecording = true;
//     } else {
//       stopRecording();
//     }
//   };
//
// // Вспомогательная функция для остановки записи
//   const stopRecording = () => {
//     clearTimeout(recordingTimeout); // Сбрасываем таймер
//     mediaRecorder.stop();
//     isRecording = false;
//   };

  const setUpVoiceMode = (tf) => {
    setVoiceMode(tf);
  }

  return (
    <div className={styles["app-container"]}>
      <div className={styles['chat-headers']}>
        <Link to="/">
          <svg width="12" height="20" viewBox="0 0 12 20" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd"
                  d="M10.9595 0.480515C11.5226 1.01044 11.5494 1.89646 11.0195 2.45951L3.92255 10L11.0195 17.5405C11.5494 18.1035 11.5226 18.9896 10.9595 19.5195C10.3965 20.0494 9.51045 20.0225 8.98053 19.4595L0.980526 10.9595C0.473166 10.4204 0.473166 9.57955 0.980526 9.04048L8.98053 0.540484C9.51045 -0.0225589 10.3965 -0.0494082 10.9595 0.480515Z"
                  fill="#2688EB"/>
          </svg>
        </Link>
        <span className={styles['header-chat__txt']}>Мой Нижний</span>
        <svg width="26" height="24" viewBox="0 0 26 24" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path fill-rule="evenodd" clip-rule="evenodd"
                d="M9.50001 13.3125C9.50001 12.5876 10.0876 12 10.8125 12H15.1875C15.9124 12 16.5 12.5876 16.5 13.3125C16.5 14.0374 15.9124 14.625 15.1875 14.625H10.8125C10.0876 14.625 9.50001 14.0374 9.50001 13.3125Z"
                fill="#007AFF"/>
          <path fill-rule="evenodd" clip-rule="evenodd"
                d="M18.6875 23.375C21.3454 23.375 23.5 21.2204 23.5 18.5625V9.17042C23.572 9.14147 23.6459 9.10817 23.7212 9.06983C24.248 8.80138 24.6764 8.37303 24.9448 7.84617C25.1743 7.39571 25.2233 6.99019 25.2389 6.79868C25.2478 6.6894 25.2507 6.57959 25.25 6.46997L25.25 5.97922C25.2501 5.55165 25.2502 5.08807 25.2174 4.6868C25.1803 4.23265 25.0885 3.63266 24.7731 3.01377C24.3537 2.19057 23.6844 1.5213 22.8612 1.10186C22.2423 0.786522 21.6423 0.694688 21.1881 0.657584C20.7869 0.6248 20.3233 0.62491 19.8958 0.625012L6.10489 0.625011C5.67767 0.624909 5.21441 0.624799 4.8134 0.657551C4.35948 0.694624 3.75988 0.786376 3.14129 1.10136C2.31843 1.52036 1.64924 2.18898 1.22954 3.01148C0.914026 3.6298 0.821762 4.22932 0.784301 4.68321C0.751206 5.08419 0.75092 5.54745 0.750657 5.97467L0.750231 6.4697C0.750055 6.49021 0.748741 6.64388 0.761077 6.79641C0.77657 6.98798 0.825179 7.39382 1.05458 7.8447C1.32286 8.37201 1.75127 8.80079 2.27834 9.06952C2.35375 9.10796 2.4279 9.14135 2.50001 9.17036V18.5625C2.50001 21.2204 4.65464 23.375 7.31251 23.375H18.6875ZM3.81251 6.75002H22.1875H22.345C22.5518 6.75002 22.625 6.69286 22.625 6.47002L22.625 6.04998C22.625 5.0699 22.625 4.57986 22.4342 4.20552C22.2664 3.87624 21.9987 3.60853 21.6695 3.44076C21.2951 3.25002 20.8051 3.25002 19.825 3.25002H6.17561C5.19627 3.25002 4.7066 3.25002 4.33242 3.44056C4.00327 3.60816 3.7356 3.87561 3.56772 4.20461C3.37686 4.57863 3.37644 5.06829 3.37561 6.04763L3.37525 6.46978C3.37507 6.67668 3.43223 6.75002 3.65525 6.75002H3.81251ZM5.12501 9.37502V18.5625C5.12501 19.7706 6.10438 20.75 7.31251 20.75H18.6875C19.8956 20.75 20.875 19.7706 20.875 18.5625V9.37502H5.12501Z"
                fill="#007AFF"/>
          <path fill-rule="evenodd" clip-rule="evenodd"
                d="M10.8125 12C10.0876 12 9.50001 12.5876 9.50001 13.3125C9.50001 14.0374 10.0876 14.625 10.8125 14.625H15.1875C15.9124 14.625 16.5 14.0374 16.5 13.3125C16.5 12.5876 15.9124 12 15.1875 12H10.8125Z"
                fill="#007AFF"/>
        </svg>
      </div>
      <div className={styles['tabs-chats']}>
        <Tabs selectedClassName={styles['active_tab']}>
          <TabList className={styles['tab-list']}>
            <Tab className={styles['tab']}>Онлайн-помощь</Tab>
            <Tab className={styles['tab']}>Решить самому</Tab>
          </TabList>

          <TabPanel>
            <div className={styles['tab-panel__ai']}>
              {/*{voiceMode ? (*/}
              {/*  <div className={styles["voice-mode-on"]}>*/}
              {/*    <div className={styles["voice-mode-on__txt"]}>*/}
              {/*      <span className={styles['voice-mode-on__header']}>Давайте разберёмся, что произошло</span>*/}
              {/*      <span className={styles['voice-mode-on__descr']}>Расскажите о проблеме</span>*/}
              {/*    </div>*/}
              {/*    <div onClick={() => {*/}
              {/*      sendAudioMessage()*/}
              {/*      setVoiceMode(false)*/}
              {/*    }}>*/}
              {/*      <svg width="187" height="188" viewBox="0 0 187 188" fill="none" xmlns="http://www.w3.org/2000/svg">*/}
              {/*        <rect y="0.5" width="187" height="187" rx="93.5" fill="#D9D9D9" fill-opacity="0.2"/>*/}
              {/*        <circle cx="93" cy="94" r="81" fill="#D9D9D9" fill-opacity="0.2"/>*/}
              {/*        <rect x="30.5" y="30.5" width="126" height="126" rx="63" fill="#3F8AE0"/>*/}
              {/*        <path fill-rule="evenodd" clip-rule="evenodd"*/}
              {/*              d="M81.4828 81.5C81.4828 74.8726 86.8593 69.5 93.4916 69.5C100.124 69.5 105.5 74.8726 105.5 81.5V91.5C105.5 98.1274 100.124 103.5 93.4916 103.5C86.8593 103.5 81.4828 98.1274 81.4828 91.5V81.5ZM93.4916 73.5C89.0701 73.5 85.4857 77.0817 85.4857 81.5V91.5C85.4857 95.9183 89.0701 99.5 93.4916 99.5C97.9131 99.5 101.497 95.9183 101.497 91.5V81.5C101.497 77.0817 97.9131 73.5 93.4916 73.5Z"*/}
              {/*              fill="white"/>*/}
              {/*        <path*/}
              {/*          d="M111.277 100.673C111.784 99.6914 111.399 98.4851 110.416 97.9784C109.434 97.4718 108.227 97.8568 107.72 98.8384C106.373 101.445 104.335 103.632 101.829 105.16C99.3226 106.687 96.4441 107.497 93.5083 107.5C90.5725 107.503 87.6923 106.699 85.1827 105.177C82.6731 103.655 80.6307 101.472 79.2787 98.8681C78.7697 97.8877 77.5616 97.5052 76.5804 98.0138C75.5992 98.5225 75.2165 99.7297 75.7255 100.71C77.4155 103.965 79.9685 106.693 83.1055 108.596C85.6635 110.148 88.5295 111.102 91.4901 111.4V117.5C91.4901 118.605 92.3862 119.5 93.4916 119.5C94.5969 119.5 95.493 118.605 95.493 117.5V111.4C98.4678 111.101 101.347 110.139 103.913 108.575C107.046 106.665 109.594 103.932 111.277 100.673Z"*/}
              {/*          fill="white"/>*/}
              {/*      </svg>*/}
              {/*    </div>*/}
              {/*    <button onClick={() => {*/}
              {/*      setVoiceMode(false)*/}
              {/*    }} className={styles["voice-mode-off__btn"]}>*/}
              {/*      <svg width="20" height="16" viewBox="0 0 20 16" fill="none" xmlns="http://www.w3.org/2000/svg">*/}
              {/*        <path fill-rule="evenodd" clip-rule="evenodd"*/}
              {/*              d="M13.5384 2.45263e-07H6.4616C5.51409 -8.91382e-06 4.74834 -1.63056e-05 4.12792 0.0506741C3.48863 0.102906 2.92481 0.213413 2.40244 0.479572C1.57453 0.901415 0.901415 1.57453 0.479572 2.40244C0.213413 2.92481 0.102906 3.48863 0.0506744 4.12792C-1.59033e-05 4.74834 -8.68951e-06 5.51409 2.35958e-07 6.46158V9.53841C-8.68951e-06 10.4859 -1.59033e-05 11.2517 0.0506743 11.8721C0.102906 12.5114 0.213413 13.0752 0.479572 13.5976C0.901415 14.4255 1.57453 15.0986 2.40244 15.5204C2.92481 15.7866 3.48863 15.8971 4.12792 15.9493C4.74834 16 5.51409 16 6.46159 16H13.5384C14.4859 16 15.2517 16 15.8721 15.9493C16.5114 15.8971 17.0752 15.7866 17.5976 15.5204C18.4255 15.0986 19.0986 14.4255 19.5204 13.5976C19.7866 13.0752 19.8971 12.5114 19.9493 11.8721C20 11.2517 20 10.4859 20 9.53842V6.46159C20 5.51409 20 4.74834 19.9493 4.12792C19.8971 3.48863 19.7866 2.92481 19.5204 2.40244C19.0986 1.57453 18.4255 0.901415 17.5976 0.479572C17.0752 0.213413 16.5114 0.102906 15.8721 0.0506742C15.2517 -1.63056e-05 14.4859 -8.91382e-06 13.5384 2.45263e-07ZM3.21963 2.08338C3.44595 1.96807 3.74652 1.88783 4.2745 1.8447C4.81298 1.8007 5.50506 1.8 6.5 1.8H13.5C14.4949 1.8 15.187 1.8007 15.7255 1.8447C16.2535 1.88783 16.5541 1.96807 16.7804 2.08338C17.2696 2.33265 17.6673 2.7304 17.9166 3.21963C18.0319 3.44595 18.1122 3.74652 18.1553 4.2745C18.1993 4.81298 18.2 5.50506 18.2 6.5V9.50001C18.2 10.4949 18.1993 11.187 18.1553 11.7255C18.1122 12.2535 18.0319 12.5541 17.9166 12.7804C17.6673 13.2696 17.2696 13.6673 16.7804 13.9166C16.5541 14.0319 16.2535 14.1122 15.7255 14.1553C15.187 14.1993 14.4949 14.2 13.5 14.2H6.5C5.50506 14.2 4.81298 14.1993 4.2745 14.1553C3.74652 14.1122 3.44595 14.0319 3.21963 13.9166C2.7304 13.6673 2.33265 13.2696 2.08338 12.7804C1.96807 12.5541 1.88783 12.2535 1.8447 11.7255C1.8007 11.187 1.8 10.4949 1.8 9.5V6.5C1.8 5.50505 1.8007 4.81298 1.8447 4.2745C1.88783 3.74652 1.96807 3.44595 2.08338 3.21963C2.33265 2.7304 2.7304 2.33265 3.21963 2.08338ZM5.125 4C4.50368 4 4 4.50368 4 5.125C4 5.74632 4.50368 6.25 5.125 6.25C5.74632 6.25 6.25 5.74632 6.25 5.125C6.25 4.50368 5.74632 4 5.125 4ZM7.25 5.125C7.25 4.50368 7.75368 4 8.375 4C8.99632 4 9.5 4.50368 9.5 5.125C9.5 5.74632 8.99632 6.25 8.375 6.25C7.75368 6.25 7.25 5.74632 7.25 5.125ZM11.625 4C11.0037 4 10.5 4.50368 10.5 5.125C10.5 5.74632 11.0037 6.25 11.625 6.25C12.2463 6.25 12.75 5.74632 12.75 5.125C12.75 4.50368 12.2463 4 11.625 4ZM13.75 5.125C13.75 4.50368 14.2537 4 14.875 4C15.4963 4 16 4.50368 16 5.125C16 5.74632 15.4963 6.25 14.875 6.25C14.2537 6.25 13.75 5.74632 13.75 5.125ZM5.125 7.25C4.50368 7.25 4 7.75368 4 8.375C4 8.99632 4.50368 9.5 5.125 9.5C5.74632 9.5 6.25 8.99632 6.25 8.375C6.25 7.75368 5.74632 7.25 5.125 7.25ZM7.25 8.375C7.25 7.75368 7.75368 7.25 8.375 7.25C8.99632 7.25 9.5 7.75368 9.5 8.375C9.5 8.99632 8.99632 9.5 8.375 9.5C7.75368 9.5 7.25 8.99632 7.25 8.375ZM11.625 7.25C11.0037 7.25 10.5 7.75368 10.5 8.375C10.5 8.99632 11.0037 9.5 11.625 9.5C12.2463 9.5 12.75 8.99632 12.75 8.375C12.75 7.75368 12.2463 7.25 11.625 7.25ZM13.75 8.375C13.75 7.75368 14.2537 7.25 14.875 7.25C15.4963 7.25 16 7.75368 16 8.375C16 8.99632 15.4963 9.5 14.875 9.5C14.2537 9.5 13.75 8.99632 13.75 8.375ZM5.9 11.1C5.40294 11.1 5 11.5029 5 12C5 12.497 5.40294 12.9 5.9 12.9H14.1C14.597 12.9 15 12.497 15 12C15 11.5029 14.597 11.1 14.1 11.1H5.9Z"*/}
              {/*              fill="#2688EB"/>*/}
              {/*      </svg>*/}
              {/*      <span className={styles["voice-mode-off__btn-txt"]}>Перейти к тексту</span>*/}
              {/*    </button>*/}
              {/*  </div>*/}
              {/*) : (*/}
              {/*  <div className={styles['ai__chat']}>*/}
              {/*    <FunctioningChat/>*/}
              {/*  </div>*/}
              {/*)}*/}
              <div className={styles['ai__chat']}>
                <FunctioningChat/>
              </div>
            </div>
          </TabPanel>
          <TabPanel>
            <div className={styles['tab-panel__form']}>
              <form method="post" className={styles['request-form']}>
                <div className={styles['request-form__form-text']}>
                  <label htmlFor="fullName">
                    ФИО
                    <svg width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path
                        d="M7.00009 0.142578C10.7872 0.142578 13.8572 3.21263 13.8572 6.99972C13.8572 10.7868 10.7872 13.8569 7.00009 13.8569C3.21299 13.8569 0.142944 10.7868 0.142944 6.99972C0.142944 3.21263 3.21299 0.142578 7.00009 0.142578ZM7.00009 1.28544C3.84417 1.28544 1.2858 3.84381 1.2858 6.99972C1.2858 10.1556 3.84417 12.714 7.00009 12.714C10.156 12.714 12.7144 10.1556 12.7144 6.99972C12.7144 3.84381 10.156 1.28544 7.00009 1.28544ZM7.04216 5.85686C7.17793 5.85686 7.26315 5.87808 7.33765 5.91792C7.41215 5.95776 7.47062 6.01623 7.51046 6.09073C7.5503 6.16522 7.57152 6.25045 7.57152 6.38622V9.89893C7.57152 10.0347 7.5503 10.1199 7.51046 10.1944C7.47062 10.2689 7.41215 10.3274 7.33765 10.3672C7.26315 10.4071 7.17793 10.4283 7.04216 10.4283H6.95802C6.82225 10.4283 6.73702 10.4071 6.66252 10.3672C6.58803 10.3274 6.52956 10.2689 6.48972 10.1944C6.44988 10.1199 6.42866 10.0347 6.42866 9.89893V6.38622C6.42866 6.25045 6.44988 6.16522 6.48972 6.09073C6.52956 6.01623 6.58803 5.95776 6.66252 5.91792C6.73702 5.87808 6.82225 5.85686 6.95802 5.85686H7.04216ZM7.00009 3.34258C7.44192 3.34258 7.80009 3.70075 7.80009 4.14258C7.80009 4.58441 7.44192 4.94258 7.00009 4.94258C6.55826 4.94258 6.20009 4.58441 6.20009 4.14258C6.20009 3.70075 6.55826 3.34258 7.00009 3.34258Z"
                        fill="#2688EB"/>
                    </svg>
                  </label>
                  <input type="text" id="fullName" required></input>
                </div>
                <div className={styles['request-form__form-text']}>
                  <label htmlFor="problemType">Заголовок
                    <svg width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path
                        d="M7.00009 0.142578C10.7872 0.142578 13.8572 3.21263 13.8572 6.99972C13.8572 10.7868 10.7872 13.8569 7.00009 13.8569C3.21299 13.8569 0.142944 10.7868 0.142944 6.99972C0.142944 3.21263 3.21299 0.142578 7.00009 0.142578ZM7.00009 1.28544C3.84417 1.28544 1.2858 3.84381 1.2858 6.99972C1.2858 10.1556 3.84417 12.714 7.00009 12.714C10.156 12.714 12.7144 10.1556 12.7144 6.99972C12.7144 3.84381 10.156 1.28544 7.00009 1.28544ZM7.04216 5.85686C7.17793 5.85686 7.26315 5.87808 7.33765 5.91792C7.41215 5.95776 7.47062 6.01623 7.51046 6.09073C7.5503 6.16522 7.57152 6.25045 7.57152 6.38622V9.89893C7.57152 10.0347 7.5503 10.1199 7.51046 10.1944C7.47062 10.2689 7.41215 10.3274 7.33765 10.3672C7.26315 10.4071 7.17793 10.4283 7.04216 10.4283H6.95802C6.82225 10.4283 6.73702 10.4071 6.66252 10.3672C6.58803 10.3274 6.52956 10.2689 6.48972 10.1944C6.44988 10.1199 6.42866 10.0347 6.42866 9.89893V6.38622C6.42866 6.25045 6.44988 6.16522 6.48972 6.09073C6.52956 6.01623 6.58803 5.95776 6.66252 5.91792C6.73702 5.87808 6.82225 5.85686 6.95802 5.85686H7.04216ZM7.00009 3.34258C7.44192 3.34258 7.80009 3.70075 7.80009 4.14258C7.80009 4.58441 7.44192 4.94258 7.00009 4.94258C6.55826 4.94258 6.20009 4.58441 6.20009 4.14258C6.20009 3.70075 6.55826 3.34258 7.00009 3.34258Z"
                        fill="#2688EB"/>
                    </svg>
                  </label>
                  <input type="text" id="problemType" required></input>
                </div>
                <div className={styles['request-form__form-text']}>
                  <label htmlFor="address">Адрес проживания
                    <svg width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path
                        d="M7.00009 0.142578C10.7872 0.142578 13.8572 3.21263 13.8572 6.99972C13.8572 10.7868 10.7872 13.8569 7.00009 13.8569C3.21299 13.8569 0.142944 10.7868 0.142944 6.99972C0.142944 3.21263 3.21299 0.142578 7.00009 0.142578ZM7.00009 1.28544C3.84417 1.28544 1.2858 3.84381 1.2858 6.99972C1.2858 10.1556 3.84417 12.714 7.00009 12.714C10.156 12.714 12.7144 10.1556 12.7144 6.99972C12.7144 3.84381 10.156 1.28544 7.00009 1.28544ZM7.04216 5.85686C7.17793 5.85686 7.26315 5.87808 7.33765 5.91792C7.41215 5.95776 7.47062 6.01623 7.51046 6.09073C7.5503 6.16522 7.57152 6.25045 7.57152 6.38622V9.89893C7.57152 10.0347 7.5503 10.1199 7.51046 10.1944C7.47062 10.2689 7.41215 10.3274 7.33765 10.3672C7.26315 10.4071 7.17793 10.4283 7.04216 10.4283H6.95802C6.82225 10.4283 6.73702 10.4071 6.66252 10.3672C6.58803 10.3274 6.52956 10.2689 6.48972 10.1944C6.44988 10.1199 6.42866 10.0347 6.42866 9.89893V6.38622C6.42866 6.25045 6.44988 6.16522 6.48972 6.09073C6.52956 6.01623 6.58803 5.95776 6.66252 5.91792C6.73702 5.87808 6.82225 5.85686 6.95802 5.85686H7.04216ZM7.00009 3.34258C7.44192 3.34258 7.80009 3.70075 7.80009 4.14258C7.80009 4.58441 7.44192 4.94258 7.00009 4.94258C6.55826 4.94258 6.20009 4.58441 6.20009 4.14258C6.20009 3.70075 6.55826 3.34258 7.00009 3.34258Z"
                        fill="#2688EB"/>
                    </svg>
                  </label>
                  <input type="text" id="address" required></input>
                </div>
                <div className={styles['request-form__form-text']}>
                  <label htmlFor="phoneNumber">Номер телефона
                    <svg width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path
                        d="M7.00009 0.142578C10.7872 0.142578 13.8572 3.21263 13.8572 6.99972C13.8572 10.7868 10.7872 13.8569 7.00009 13.8569C3.21299 13.8569 0.142944 10.7868 0.142944 6.99972C0.142944 3.21263 3.21299 0.142578 7.00009 0.142578ZM7.00009 1.28544C3.84417 1.28544 1.2858 3.84381 1.2858 6.99972C1.2858 10.1556 3.84417 12.714 7.00009 12.714C10.156 12.714 12.7144 10.1556 12.7144 6.99972C12.7144 3.84381 10.156 1.28544 7.00009 1.28544ZM7.04216 5.85686C7.17793 5.85686 7.26315 5.87808 7.33765 5.91792C7.41215 5.95776 7.47062 6.01623 7.51046 6.09073C7.5503 6.16522 7.57152 6.25045 7.57152 6.38622V9.89893C7.57152 10.0347 7.5503 10.1199 7.51046 10.1944C7.47062 10.2689 7.41215 10.3274 7.33765 10.3672C7.26315 10.4071 7.17793 10.4283 7.04216 10.4283H6.95802C6.82225 10.4283 6.73702 10.4071 6.66252 10.3672C6.58803 10.3274 6.52956 10.2689 6.48972 10.1944C6.44988 10.1199 6.42866 10.0347 6.42866 9.89893V6.38622C6.42866 6.25045 6.44988 6.16522 6.48972 6.09073C6.52956 6.01623 6.58803 5.95776 6.66252 5.91792C6.73702 5.87808 6.82225 5.85686 6.95802 5.85686H7.04216ZM7.00009 3.34258C7.44192 3.34258 7.80009 3.70075 7.80009 4.14258C7.80009 4.58441 7.44192 4.94258 7.00009 4.94258C6.55826 4.94258 6.20009 4.58441 6.20009 4.14258C6.20009 3.70075 6.55826 3.34258 7.00009 3.34258Z"
                        fill="#2688EB"/>
                    </svg>
                  </label>
                  <input type="tel" id="phoneNumber" required></input>
                </div>
                <div className={styles['request-form__form-textarea']}>
                  <label htmlFor="description">Описание
                    <svg width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path
                        d="M7.00009 0.142578C10.7872 0.142578 13.8572 3.21263 13.8572 6.99972C13.8572 10.7868 10.7872 13.8569 7.00009 13.8569C3.21299 13.8569 0.142944 10.7868 0.142944 6.99972C0.142944 3.21263 3.21299 0.142578 7.00009 0.142578ZM7.00009 1.28544C3.84417 1.28544 1.2858 3.84381 1.2858 6.99972C1.2858 10.1556 3.84417 12.714 7.00009 12.714C10.156 12.714 12.7144 10.1556 12.7144 6.99972C12.7144 3.84381 10.156 1.28544 7.00009 1.28544ZM7.04216 5.85686C7.17793 5.85686 7.26315 5.87808 7.33765 5.91792C7.41215 5.95776 7.47062 6.01623 7.51046 6.09073C7.5503 6.16522 7.57152 6.25045 7.57152 6.38622V9.89893C7.57152 10.0347 7.5503 10.1199 7.51046 10.1944C7.47062 10.2689 7.41215 10.3274 7.33765 10.3672C7.26315 10.4071 7.17793 10.4283 7.04216 10.4283H6.95802C6.82225 10.4283 6.73702 10.4071 6.66252 10.3672C6.58803 10.3274 6.52956 10.2689 6.48972 10.1944C6.44988 10.1199 6.42866 10.0347 6.42866 9.89893V6.38622C6.42866 6.25045 6.44988 6.16522 6.48972 6.09073C6.52956 6.01623 6.58803 5.95776 6.66252 5.91792C6.73702 5.87808 6.82225 5.85686 6.95802 5.85686H7.04216ZM7.00009 3.34258C7.44192 3.34258 7.80009 3.70075 7.80009 4.14258C7.80009 4.58441 7.44192 4.94258 7.00009 4.94258C6.55826 4.94258 6.20009 4.58441 6.20009 4.14258C6.20009 3.70075 6.55826 3.34258 7.00009 3.34258Z"
                        fill="#2688EB"/>
                    </svg>
                  </label>
                  <textarea id="description" placeholder="Введите описание" required></textarea>
                </div>
                <div className={styles['request-form__form-files']}>
                  <label htmlFor="addMaterials" className={styles["label-for-files"]}>
                    <div>
                      Материалы
                      <svg width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path
                          d="M7.00009 0.142578C10.7872 0.142578 13.8572 3.21263 13.8572 6.99972C13.8572 10.7868 10.7872 13.8569 7.00009 13.8569C3.21299 13.8569 0.142944 10.7868 0.142944 6.99972C0.142944 3.21263 3.21299 0.142578 7.00009 0.142578ZM7.00009 1.28544C3.84417 1.28544 1.2858 3.84381 1.2858 6.99972C1.2858 10.1556 3.84417 12.714 7.00009 12.714C10.156 12.714 12.7144 10.1556 12.7144 6.99972C12.7144 3.84381 10.156 1.28544 7.00009 1.28544ZM7.04216 5.85686C7.17793 5.85686 7.26315 5.87808 7.33765 5.91792C7.41215 5.95776 7.47062 6.01623 7.51046 6.09073C7.5503 6.16522 7.57152 6.25045 7.57152 6.38622V9.89893C7.57152 10.0347 7.5503 10.1199 7.51046 10.1944C7.47062 10.2689 7.41215 10.3274 7.33765 10.3672C7.26315 10.4071 7.17793 10.4283 7.04216 10.4283H6.95802C6.82225 10.4283 6.73702 10.4071 6.66252 10.3672C6.58803 10.3274 6.52956 10.2689 6.48972 10.1944C6.44988 10.1199 6.42866 10.0347 6.42866 9.89893V6.38622C6.42866 6.25045 6.44988 6.16522 6.48972 6.09073C6.52956 6.01623 6.58803 5.95776 6.66252 5.91792C6.73702 5.87808 6.82225 5.85686 6.95802 5.85686H7.04216ZM7.00009 3.34258C7.44192 3.34258 7.80009 3.70075 7.80009 4.14258C7.80009 4.58441 7.44192 4.94258 7.00009 4.94258C6.55826 4.94258 6.20009 4.58441 6.20009 4.14258C6.20009 3.70075 6.55826 3.34258 7.00009 3.34258Z"
                          fill="#2688EB"/>
                      </svg>
                    </div>
                    <div className={styles['request-form__form-files--label']}>
                      <svg width="18" height="22" viewBox="0 0 18 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd"
                              d="M8.95228 2.05635C11.0221 -0.0187818 14.3791 -0.0187818 16.4489 2.05635C18.517 4.12986 18.517 7.49049 16.4489 9.56402L9.99097 16.0391C8.73629 17.297 6.70082 17.297 5.44614 16.0391C4.19338 14.7831 4.19306 12.7481 5.44518 11.4917L8.58143 8.33242C9.01916 7.89148 9.73146 7.88887 10.1724 8.3266C10.6134 8.76433 10.616 9.47663 10.1782 9.91758L7.03918 13.0797C6.66204 13.4578 6.66204 14.072 7.03918 14.4501C7.41471 14.8266 8.02237 14.8266 8.39791 14.4501L14.8558 7.97514C16.048 6.77982 16.0481 4.8406 14.8558 3.64529C13.6652 2.45157 11.736 2.45157 10.5453 3.64529L3.90384 10.3039C3.65957 10.5488 3.56555 10.6435 3.49348 10.723C1.8355 12.5517 1.8355 15.3453 3.49348 17.174C3.75462 17.462 4.03452 17.7426 4.32186 18.0045C5.21257 18.8162 6.45343 19.2418 7.69984 19.2456C8.95286 19.2495 10.0862 18.829 10.802 18.1131C10.9525 17.9626 11.1074 17.8164 11.2577 17.6657L14.5785 14.3364C15.0173 13.8965 15.7296 13.8956 16.1695 14.3343C16.6094 14.7731 16.6103 15.4854 16.1715 15.9253L12.8264 19.2791C12.6256 19.4805 12.4937 19.6127 12.3747 19.7223C11.148 20.9373 9.3993 21.5009 7.6929 21.4956C5.97138 21.4903 4.16726 20.9078 2.80631 19.6675C2.46645 19.3578 2.13548 19.026 1.82659 18.6853C-0.608861 15.999 -0.608867 11.8979 1.82659 9.21172C1.93947 9.08722 2.07458 8.95176 2.28643 8.73938L8.95228 2.05635Z"
                              fill="#99A2AD"/>
                      </svg>
                      <span>Загрузить файл</span>
                    </div>
                  </label>
                  <input type="file" id="addMaterials" required hidden></input>
                </div>
                <div className={styles["request-form__form-checkbox"]}>
                  <input type="checkbox" id="consent" required></input>
                  <label htmlFor="consent">Я соглашаюсь с правилами подачи сообщения</label>
                </div>
                <input className={styles['request-form__submit']} type="submit" value="Отправить"/>
                <input className={styles['request-form__reset']} type="reset" value="Отменить сообщение"/>
              </form>
            </div>
          </TabPanel>
        </Tabs>
      </div>

      <div className={styles["chat"]}>

      </div>
      <Outlet/>
    </div>
  )
}

export default Chat;